shapes = [[(0, 0), (0, 1), (0, 2), (0, 3)],  # ㅡ
          [(0, 0), (1, 0), (2, 0), (3, 0)],  # ㅣ
          [(0, 0), (0, 1), (1, 0), (1, 1)],  # ㅁ
          # L, J 모양 (8개)
          [(0, 0), (-1, 0), (-2, 0), (-2, -1)], 
          [(0, 0), (-1, 0), (-2, 0), (-2, 1)],  
          [(0, 0), (1, 0), (2, 0), (2, -1)],  
          [(0, 0), (1, 0), (2, 0), (2, 1)],  
          [(0, 0), (0, -1), (0, -2), (-1, -2)], 
          [(0, 0), (0, 1), (0, 2), (-1, 2)],  
          [(0, 0), (0, 1), (0, 2), (1, 2)],  
          [(0, 0), (0, -1), (0, -2), (1, -2)],
          # Z, S 모양
          [(0, 0), (1, 0), (1, 1), (2, 1)],  # 세로S
          [(0, 0), (-1, 0), (-1, 1), (-2, 1)],  # 세로Z
          [(0, 0), (0, 1), (-1, 1), (-1, 2)],  # S
          [(0, 0), (0, 1), (1, 1), (1, 2)],  # Z
          # ㅗ 모양
          [(0, 0), (-1, -1), (-1, 0), (-1, 1)],  # 상
          [(0, 0), (-1, 1), (0, 1), (1, 1)],  # 우
          [(0, 0), (1, -1), (1, 0), (1, 1)],  # 하
          [(0, 0), (-1, 0), (1, 0), (0, 1)]]  # 좌


def func(i, j):
    global res
    for shape in shapes:
        sm = 0
        for di, dj in shape:
            ni, nj = i + di, j + dj

            if not (0 <= ni < N and 0 <= nj < M):
                break
            else:
                sm += grid[ni][nj]
        else:
            res = max(res, sm)


N, M = map(int, input().split())
grid = [list(map(int, input().split())) for _ in range(N)]

mx_num = 0
for row in grid:
    mx_num = max(mx_num, max(row))

res = 0
for i in range(N):
    for j in range(M):
        func(i, j)
print(res)