N, M = map(int, input().split())
grid = [ list(map(int, input().split())) for _ in range(N) ]

squ = [[
    [(0,0), (1,0), (0,1), (1,1)]
]]

st = [[
    [(0,0), (0,1), (0,2), (0,3)],
    [(0,0), (1,0), (2,0), (3,0)]
]]

gun = [[
    [(0,0), (0,1), (0,2), (1,2)],
    [(0,0), (0,1), (-1,1), (-2,1)],
    [(0,0), (1,0), (1,1), (1,2)],
    [(0,0), (-1,0), (-2,0), (-2,1)],

    [(0,0), (-1,0), (-1,1), (-1,2)],
    [(0,0), (1,0), (2,0), (2,1)],
    [(0,0), (0,1), (0,2), (-1,2)],
    [(0,0), (0,1), (1,1), (2,1)]
]]

oh = [[
    [(0,0), (0,1), (0,2), (1,1)],
    [(0,0), (0,1), (-1,1), (1,1)],
    [(0,0), (0,1), (0,2), (-1,1)],
    [(0,0), (1,0), (2,0), (1,1)]
]]

thd = [[
    [(0,0), (1,0), (1,1), (2,1)],
    [(0,0), (0,1), (-1,1), (-1,2)],
    [(0,0), (-1,0), (-1,1), (-2,1)],
    [(0,0), (0,1), (1,1), (1,2)]
]]



def put_tet(x, y):
    tot = 0
    for type in (squ, st, gun, oh, thd) :
        for each in type : # 각 타입별로 각 모양
            for dv in each : # # 각 모양의 위치벡터
                temp = 0
                for dx, dy in dv : # 위치벡터들을 무사히 통과하면 해당 모양은 완성
                    nx, ny = x + dx, y + dy
                    if 0 <= nx <= N-1 and 0 <= ny <= M-1 :
                        temp += grid[nx][ny]
                    else : # 한번이라도 통과하지 못했다면
                        break
                else : # 무사히 통과했다면
                    tot = max(tot, temp)

    return tot

# ==========================================================
best_max = 0
for x in range(N) :
    for y in range(M) :
        best_max = max(best_max, put_tet(x, y))

print(best_max)